#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`                  
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
azurerm_kubernetes_cluster.main: Refreshing state... [id=/subscriptions/a819e63a-3481-4643-8224-f00caca0d2e1/resourceGroups/tcc-unicarioca-gitops/providers/Microsoft.ContainerService/managedClusters/tcc-unicarioca-gitops-aks-cluster]
azurerm_role_assignment.external_dns: Refreshing state... [id=/subscriptions/a819e63a-3481-4643-8224-f00caca0d2e1/resourceGroups/tcc-unicarioca-gitops/providers/Microsoft.Network/dnsZones/tcc-unicarioca.tech/providers/Microsoft.Authorization/roleAssignments/c14404e7-6211-d3ab-b522-8785b0d0b9b8]
kubectl_manifest.ingress_namespace: Refreshing state... [id=/api/v1/namespaces/ingress-nginx]
kubectl_manifest.db_secrets: Refreshing state... [id=/api/v1/namespaces/default/secrets/db-secrets]
kubectl_manifest.ingress_controller[9]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/ingress-nginx-admission]
kubectl_manifest.ingress_controller[11]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/services/ingress-nginx-controller]
kubectl_manifest.ingress_controller[0]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/serviceaccounts/ingress-nginx]
kubectl_manifest.ingress_controller[4]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/ingress-nginx]
kubectl_manifest.ingress_controller[1]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/serviceaccounts/ingress-nginx-admission]
kubectl_manifest.ingress_controller[12]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/services/ingress-nginx-controller-admission]
kubectl_manifest.ingress_controller[3]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/roles/ingress-nginx-admission]
kubectl_manifest.ingress_controller[7]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/rolebindings/ingress-nginx-admission]
kubectl_manifest.ingress_controller[14]: Refreshing state... [id=/apis/batch/v1/namespaces/ingress-nginx/jobs/ingress-nginx-admission-create]
kubectl_manifest.ingress_controller[8]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/ingress-nginx]
kubectl_manifest.ingress_controller[17]: Refreshing state... [id=/apis/admissionregistration.k8s.io/v1/validatingwebhookconfigurations/ingress-nginx-admission]
kubectl_manifest.ingress_controller[15]: Refreshing state... [id=/apis/batch/v1/namespaces/ingress-nginx/jobs/ingress-nginx-admission-patch]
kubectl_manifest.ingress_controller[6]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/rolebindings/ingress-nginx]
kubectl_manifest.ingress_controller[13]: Refreshing state... [id=/apis/apps/v1/namespaces/ingress-nginx/deployments/ingress-nginx-controller]
kubectl_manifest.ingress_controller[10]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/configmaps/ingress-nginx-controller]
kubectl_manifest.ingress_controller[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/roles/ingress-nginx]
kubectl_manifest.ingress_controller[5]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/ingress-nginx-admission]
helm_release.external_dns: Refreshing state... [id=external-dns]
kubectl_manifest.ingress_controller[16]: Refreshing state... [id=/apis/networking.k8s.io/v1/ingressclasses/nginx]
helm_release.cert_manager: Refreshing state... [id=cert-manager]
kubectl_manifest.cert_manager_issuer: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt]
helm_release.argocd_operator: Refreshing state... [id=argocd]
kubectl_manifest.argocd_sync_app: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/argocd/applications/argocd-appset]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_kubernetes_cluster.main will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_kubernetes_cluster" "main"  {
      + aci_connector_linux                              = (known after apply)
      ~ agent_pool_profile                               = [
          - {
              - count                    = 1
              - enable_auto_scaling      = false
              - enable_node_public_ip    = false
              - max_count                = 0
              - max_pods                 = 110
              - min_count                = 0
              - name                     = "gitopspool"
              - node_labels              = {}
              - node_public_ip_prefix_id = ""
              - node_taints              = []
              - orchestrator_version     = "1.25.6"
              - os_disk_size_gb          = 30
              - os_type                  = "Linux"
              - tags                     = {}
              - type                     = "VirtualMachineScaleSets"
              - upgrade_settings         = []
              - vm_size                  = "Standard_D2_v2"
              - vnet_subnet_id           = ""
              - zones                    = []
            },
        ] -> (known after apply)
      ~ api_server_authorized_ip_ranges                  = [] -> (known after apply)
      ~ azure_active_directory_role_based_access_control = [] -> (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      ~ dns_prefix                                       = "tcc-unicarioca-gitops-k8s" -> (known after apply)
      ~ fqdn                                             = "tcc-unicarioca-gitops-k8s-tqqj2037.hcp.eastus.azmk8s.io" -> (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      ~ id                                               = "/subscriptions/a819e63a-3481-4643-8224-f00caca0d2e1/resourceGroups/tcc-unicarioca-gitops/providers/Microsoft.ContainerService/managedClusters/tcc-unicarioca-gitops-aks-cluster" -> (known after apply)
      ~ identity                                         = [
          - {
              - identity_ids = []
              - principal_id = "69cafc60-6c8b-45aa-a2b9-57dd98eafe76"
              - tenant_id    = "f41187ea-9d6b-43e7-8b3b-e56af6487b0a"
              - type         = "SystemAssigned"
            },
        ] -> (known after apply)
      + ingress_application_gateway                      = (known after apply)
      ~ key_management_service                           = [] -> (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      ~ kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      ~ kube_config                                      = (sensitive value)
      ~ kube_config_raw                                  = (sensitive value)
      ~ kubelet_identity                                 = [
          - {
              - client_id                 = "cf05e816-a62a-40e1-a85e-7fd907c363d3"
              - object_id                 = "7b29d68e-8da5-464f-8c75-00f128ce6c0f"
              - user_assigned_identity_id = "/subscriptions/a819e63a-3481-4643-8224-f00caca0d2e1/resourceGroups/MC_tcc-unicarioca-gitops_tcc-unicarioca-gitops-aks-cluster_eastus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/tcc-unicarioca-gitops-aks-cluster-agentpool"
            },
        ] -> (known after apply)
      ~ kubernetes_version                               = "1.25.6" -> (known after apply)
      ~ linux_profile                                    = [
          - {
              - admin_username = ""
              - ssh_key        = []
            },
        ] -> (known after apply)
      ~ location                                         = "eastus" -> (known after apply)
      ~ microsoft_defender                               = [] -> (known after apply)
        name                                             = "tcc-unicarioca-gitops-aks-cluster"
      ~ network_profile                                  = [
          - {
              - dns_service_ip     = "10.0.0.10"
              - docker_bridge_cidr = "172.17.0.1/16"
              - load_balancer_sku  = "Standard"
              - network_plugin     = "kubenet"
              - network_policy     = ""
              - pod_cidr           = "10.244.0.0/16"
              - service_cidr       = "10.0.0.0/16"
            },
        ] -> (known after apply)
      ~ node_resource_group                              = "MC_tcc-unicarioca-gitops_tcc-unicarioca-gitops-aks-cluster_eastus" -> (known after apply)
      ~ node_resource_group_id                           = "/subscriptions/a819e63a-3481-4643-8224-f00caca0d2e1/resourceGroups/MC_tcc-unicarioca-gitops_tcc-unicarioca-gitops-aks-cluster_eastus" -> (known after apply)
      ~ oidc_issuer_enabled                              = false -> (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      ~ role_based_access_control_enabled                = true -> (known after apply)
      ~ service_principal                                = [
          - {
              - client_id = "msi"
            },
        ] -> (known after apply)
      ~ storage_profile                                  = [
          - {
              - blob_driver_enabled         = false
              - disk_driver_enabled         = true
              - disk_driver_version         = "v1"
              - file_driver_enabled         = true
              - snapshot_controller_enabled = true
            },
        ] -> (known after apply)
      ~ tags                                             = {} -> (known after apply)
      ~ windows_profile                                  = [] -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster.main will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "main" {
        id                                  = "/subscriptions/a819e63a-3481-4643-8224-f00caca0d2e1/resourceGroups/tcc-unicarioca-gitops/providers/Microsoft.ContainerService/managedClusters/tcc-unicarioca-gitops-aks-cluster"
        name                                = "tcc-unicarioca-gitops-aks-cluster"
        tags                                = {}
        # (24 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "gitopspool"
          ~ node_count                   = 1 -> 2
            tags                         = {}
            # (21 unchanged attributes hidden)
        }



        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @andersonfcz, Action: `pull_request`*